read COMMAND
if [ $COMMAND = "help" ]
then
    echo "All commands: "
    echo "ping"
    echo "version"
elif [ $COMMAND = "ping" ]
then
    echo "PONG"
elif [ $COMMAND = "version" ]
then
    echo "VERSION IS LAST"
else 
    echo "Unknown command"
fi

# -eq	равняется ли	if [ $age -eq 18 ]
# -ne	не равняется	if [ $age -ne 18 ]
# -gt	больше чем	if [ $age -gt 18 ]
# -ge	больше чем или равно	if [ $age -ge 18 ]
# -lt	меньше чем	if [ $age -lt 18 ]
# -le	меньше чем или равно	if [ $age -le 18 ]
# >	больше чем	if (($age > 18))
# <	меньше чем	if (($age < 18))
# =>	больше чем или равно	if (($age => 18))
# <=	меньше чем или равно	if (($age <= 18))


# =	проверка на равенство	if [ $str = "hello" ]
# ==	проверка на равенство	if [ $str == "hello" ]
# !=	проверка на НЕ равенство	if [ $str != "hello" ]
# <	сравнение меньше чем по ASCII коду символов	if [[$str < "hello"]]
# >	сравнение больше чем по ASCII коду символов	if [[$str > "hello"]]
# -z	проверка пустая ли строка	if [ -z $str ]
# -n	проверка есть ли в строке хоть один символ	if [ -n $str ]


# -e	проверяет, существует ли файл	if [ -e $file ]
# -s	проверяет, пустой ли файл	if [ -s $file ]
# -f	проверяет, является ли файл обычным файлом, а не каталогом или специальным файлом	if [ -f $file ]
# -d	проверяет, является ли файл каталогом	if [ -d $file ]
# -r	проверяет, доступен ли файл для чтения	if [ -r $file ]
# -w	проверяет, доступен ли файл для записи	if [ -w $file ]
# -x	проверяет, является ли файл исполняемым	if [ -x $file ]


# Условия с оператором "И" возвращают истину только в том случае, когда все условия истины.
# Существует несколько вариантов написания условий с логическими операторами

# if [ $age -ge 18 ] && [ $age -le ]
# if [ $age -ge 18 -a $age -le ]
# if [[ $age -ge 18 && $age -le ]]


# Условия с оператором "ИЛИ" возвращают истину в том случае, когда хотя бы одно условие истинно.

# if [ -r $file ] || [ -w $file ]
# if [ -r $file -o -w $file ]
# if [[ -r $file || -w $file ]]


